#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-9d348bf6]
aws_dynamodb_table.awsplay: Refreshing state... [id=awsplay]
aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-9e348bf5]
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_security_group.awsplay_lb_security_group: Refreshing state... [id=sg-0e4564d0ac2106f75]
aws_ecs_cluster.awsplay: Refreshing state... [id=arn:aws:ecs:eu-west-1:286972415665:cluster/awsplay]
aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-9c348bf7]
aws_default_vpc.default_vpc: Refreshing state... [id=vpc-9f348bf4]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.awsplay_task_execution_role: Refreshing state... [id=awsplay-task-execution-role]
aws_iam_role.awsplay_task_role: Refreshing state... [id=awsplay-task-role]
aws_iam_role_policy_attachment.awsplay_task_execution_role_policy: Refreshing state... [id=awsplay-task-execution-role-20230305165548904200000001]
aws_iam_role_policy_attachment.awsplay_task_role_policy: Refreshing state... [id=awsplay-task-role-20230305165548970100000002]
aws_ecs_task_definition.awsplay: Refreshing state... [id=awsplay]
aws_security_group.awsplay_fargate_security_group: Refreshing state... [id=sg-00937f60b7d2aef9a]
aws_alb.awsplay_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:loadbalancer/app/awsplay-lb/68c97ae8bc9d2fd2]
aws_route53_record.awsplay: Refreshing state... [id=Z2Z0QPGK7E01E9_awsplay.diman8.net_A]
aws_lb_target_group.fargate: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:targetgroup/fargate/05918c57c553fead]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:listener/app/awsplay-lb/68c97ae8bc9d2fd2/9cc97f19a1084862]
aws_ecs_service.awsplay_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:286972415665:service/awsplay/awsplay-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb.awsplay_lb2 will be created
  + resource "aws_alb" "awsplay_lb2" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "awsplay-lb2"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-0e4564d0ac2106f75",
        ]
      + subnets                    = [
          + "subnet-9c348bf7",
          + "subnet-9d348bf6",
          + "subnet-9e348bf5",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_ecs_service.awsplay_service will be updated in-place
  ~ resource "aws_ecs_service" "awsplay_service" {
        id                                 = "arn:aws:ecs:eu-west-1:286972415665:service/awsplay/awsplay-service"
        name                               = "awsplay-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:286972415665:task-definition/awsplay:22" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.awsplay must be replaced
-/+ resource "aws_ecs_task_definition" "awsplay" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:286972415665:task-definition/awsplay:22" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  ~ image            = "286972415665.dkr.ecr.eu-west-2.amazonaws.com/awsplay:1f6b963561731f614751036f1d9ec5eaaa86c9d7" -> "286972415665.dkr.ecr.eu-west-2.amazonaws.com/awsplay:edfd279122920582be3107c7e246d2182a95c903"
                  - mountPoints      = [] -> null
                    name             = "awsplay"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "awsplay" -> (known after apply)
      ~ revision                 = 22 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vyrostkov, Action: `pull_request`*